{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report listing UI update requirements for team member name changes and associated files.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for key frontend components, pages, and configs.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for light and dark themes, including brand colors.",
  "frontend/index.html": "Base HTML entrypoint with root div and script loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with main routes wrapped in SiteLayout.",
  "frontend/src/components/contact/BranchContactCard.tsx": "Renders a branch contact card with map embed, address, phone, hours, and CTA buttons.",
  "frontend/src/components/home/EcoFriendlySection.tsx": "Displays eco‑friendly pest control information with icons and an image.",
  "frontend/src/components/home/FeaturedServices.tsx": "Shows first three services as cards with a button linking to the full services page.",
  "frontend/src/components/home/HeroSlider.tsx": "Auto‑advancing hero slider with images, text overlays, navigation arrows, and CTA buttons.",
  "frontend/src/components/home/OurTeamSection.tsx": "Team section that renders member cards using shared teamMembers data.",
  "frontend/src/components/home/ServiceLocationsGrid.tsx": "Renders a grid of service location cards with images and icons for various property types. Uses a predefined list of locations to generate the UI.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Displays a two-column section with an image and a list of reasons highlighting company strengths. Maps over a reasons array to render icons, titles, and descriptions.",
  "frontend/src/components/layout/Footer.tsx": "Builds a footer with company info, quick links, branch details, and social icons using site configuration data. Includes dynamic year and contact links.",
  "frontend/src/components/layout/Header.tsx": "Implements a responsive header with logo, navigation links, and a mobile menu toggle. Highlights active routes using router state.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed page content via Outlet. Wraps the entire page structure.",
  "frontend/src/components/services/ServiceCard.tsx": "Displays an individual service card with image, title, description, and a link to the service detail page. Uses service data and a styled button.",
  "frontend/src/config/services.ts": "Exports the Service interface and a list of detailed service definitions including descriptions, benefits, processes, and images.",
  "frontend/src/config/site.ts": "Contains global site configuration including name, social links, and branch address/phone details. Used across layout components.",
  "frontend/src/config/team.ts": "Defines the TeamMember interface and exports a list of team member profiles with names, roles, and images.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages a backend actor based on authentication identity. Recreates and invalidates related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Empty module indicating no backend queries are needed for the static site.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, theme variables, and brand color utilities for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company background details and key statistics.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and branch cards, setting the page title on mount.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage layout including hero slider, services, team, eco-friendly info, and benefits sections.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a selected service, including images, benefits, process steps, and contact options.",
  "frontend/src/pages/ServicesListPage.tsx": "Lists all available pest control services using ServiceCard components and sets the page title on mount.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, and utilities, with plugins for typography, animations, and container queries.",
  "project_state.json": "Tracks project metadata, existing features, and a pending request to update Our Team member names across the site."
}