{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report describing a team name update tied to the team.ts config file and related components.",
  "frontend-file-summaries.txt": "JSON-like text listing summaries for all frontend files including pages, components, config, and styling.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark modes with global border and body styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with root layout and routes for all main pages.",
  "frontend/src/components/contact/BranchContactCard.tsx": "Card component showing branch info with map embed, contact details, and call/WhatsApp actions.",
  "frontend/src/components/home/EcoFriendlySection.tsx": "Section highlighting eco-friendly pest control methods with icons and descriptive text plus an image.",
  "frontend/src/components/home/FeaturedServices.tsx": "Displays three featured services with cards and a button linking to the full services list.",
  "frontend/src/components/home/HeroSlider.tsx": "Auto-rotating hero slider with images, titles, CTAs, and manual navigation controls.",
  "frontend/src/components/home/OurTeamSection.tsx": "Team display section rendering team members from the shared team configuration.",
  "frontend/src/components/home/ServiceLocationsGrid.tsx": "Displays a grid of service locations with images and icons for different property types.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Renders a promotional section listing reasons to choose the service, with icons and an accompanying image.",
  "frontend/src/components/layout/Footer.tsx": "Provides the site footer with company info, quick links, branch details, and social links.",
  "frontend/src/components/layout/Header.tsx": "Implements the site header with logo, navigation links, and a responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site layout with a header, footer, and routed page content.",
  "frontend/src/components/services/ServiceCard.tsx": "Shows a card for an individual service with image, description, and a link to its detail page.",
  "frontend/src/config/services.ts": "Defines the Service interface and a list of service configurations including descriptions and images.",
  "frontend/src/config/site.ts": "Holds site-wide configuration such as name, social links, and branch contact details.",
  "frontend/src/config/team.ts": "Exports team member data including names, roles, and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed for the static site.",
  "frontend/src/index.css": "Defines global Tailwind styles and extensive CSS variables for light and dark mode brand theming.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with company information, stats, and sets the document title on mount.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information for all branches using configuration data and sets the document title.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage by composing multiple feature sections and sets the page title on mount.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows details for a specific service based on slug, including benefits, process steps, and contact options.",
  "frontend/src/pages/ServicesListPage.tsx": "Displays a grid of all available services and sets the document title.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and brand theme extensions.",
  "project_state.json": "Tracks project metadata, known issues, and pending feature requests related to updating a team member name."
}