{
  "kind": "build_request",
  "title": "Update Our Team section names across the site",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Our Team member names by replacing \"Priya Sharma\" with \"Prayag Dhole\" and replacing \"Rajesh Kumar\" with \"Sagar Dhole\" anywhere these team members are displayed in the UI (including the OurTeamSection component data).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "Priya Sharma team member replace with Prayag dhole",
          "Rajesh Kumar team member replace with Sagar dhole"
        ]
      },
      "acceptanceCriteria": [
        "In the rendered Our Team section, the member previously shown as \"Priya Sharma\" is now displayed as \"Prayag Dhole\".",
        "In the rendered Our Team section, the member previously shown as \"Rajesh Kumar\" is now displayed as \"Sagar Dhole\".",
        "There are no remaining occurrences of the strings \"Priya Sharma\" or \"Rajesh Kumar\" in user-visible team member listings/cards."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Our Team section content is consistently updated anywhere a team section is shown on any page, so all pages that include a team section display the updated member names.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Our Team section in all pages where team mention"
        ]
      },
      "acceptanceCriteria": [
        "Every page/route that renders a team section shows the updated names (\"Prayag Dhole\" and \"Sagar Dhole\").",
        "No page that includes a team section shows the old names."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the backend as-is (no new Motoko logic/state) since this is a static content update."
  ],
  "nonGoals": [
    "Do not change team member roles/titles unless required for name replacement.",
    "Do not change team member images/photos unless explicitly requested.",
    "Do not add new pages, routes, or backend APIs for team management."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}